day2/sandwichr-advanced/app/controllers/sandwich_views_controller.rb

SELECT "sandwiches".* FROM "sandwiches"
---
	def index
		@sandwiches = Sandwich.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 2]]
SELECT "ingredients".* FROM "ingredients"
---
	def details
		@sandwich = Sandwich.find_by(id: params[:id])
		return unless @sandwich
		@ingredients = @sandwich.ingredients
		@avaible_ingredients = Ingredient.all